import type { RequiredDataFromCollectionSlug } from 'payload'
import type { Media } from '@/payload-types'
import {
  createRichText,
  createHeading,
  createParagraph,
  createList,
  createText,
  createLink,
} from '../helpers/helpers'

// Определяем тип аргументов для этой страницы
export type TermsArgs = {
  heroImage: Media
}

export const termsOfUse: (args: TermsArgs) => RequiredDataFromCollectionSlug<'pages'> = ({
  heroImage,
}) => {
  return {
    // --- Основные поля ---
    slug: 'terms-of-use',
    title: 'Правила использования Сайта',
    _status: 'published',
    publishedAt: new Date('2025-03-01').toISOString(),

    // --- Hero ---
    hero: {
      type: 'highImpact',
      links: [],
      media: heroImage.id,
      richText: createRichText([
        createHeading('h1', 'Правила использования Сайта'),
        createParagraph('Создано: 01.03.2025'),
      ]),
    },

    // --- Основной контент страницы ---
    layout: [
      {
        blockType: 'content',
        blockName: 'Terms of Use Content',
        columns: [
          {
            size: 'full',
            enableLink: false,
            richText: createRichText([
              createHeading('h2', '1. Термины и определения'),
              createParagraph(
                'Prom-stock обладает всеми правами на Сайт и Сервис и по своему усмотрению время от времени может предлагать и оказывать Пользователям услуги с использованием Сайта или содержащегося на нем программного обеспечения.',
              ),
              createParagraph([
                createText('Контент', 'bold'),
                createText(
                  ' — любая информация текстового, графического, тексто-графического, аудио- и аудиовизуального характера, которая размещается на Сайте в соответствии с настоящими Правилами.',
                ),
              ]),
              createParagraph([
                createText('Личный кабинет (аккаунт, учетная запись) Пользователя', 'bold'),
                createText(
                  ' — обособленный раздел Сайта, где размещена информация, предоставленная Пользователем при регистрации, а также предоставлены Пользователю инструменты для получения услуг prom-stock. Личный кабинет является однопользовательским, доступ к нему предоставляется при условии принятия настоящих Правил и прохождения процедуры регистрации.',
                ),
              ]),
              createParagraph([
                createText('Правила prom-stock (Правила)', 'bold'),
                createText(
                  ' — настоящий документ, актуальная и действительная версия которого всегда размещена размещена в разделе: "Правила использования Сайта", включая все приложения к ним. Правила обязательны для всех Пользователей.',
                ),
              ]),
              createParagraph([
                createText('Правообладатель', 'bold'),
                createText(
                  ' — автор или иное лицо, обладающее правами на Контент, размещаемый на "Сайте".',
                ),
              ]),
              createParagraph([
                createText('Пользователь', 'bold'),
                createText(
                  ' — дееспособное физическое лицо (в том числе, представитель юридического лица), которое посещает Сайт, пользуется Сервисом, размещает Контент на Сайте, приобретает с помощью Сервиса товары и услуги третьих лиц. Зарегистрированным Пользователем является Пользователь, который прошел процедуру регистрации на Сайте и предоставил достоверные сведения о себе на условиях, указанных в Правилах. Некоторые услуги и возможности Сервиса доступны только зарегистрированным Пользователям.',
                ),
              ]),
              createParagraph([
                createText('Сайт', 'bold'),
                createText(' — Сайт prom-stock в сети Интернет по адресу https://prom-stock.ru/'),
              ]),
              createParagraph([
                createText('Сервис', 'bold'),
                createText(
                  ' — совокупность организационных, юридических и технических средств, с помощью которой prom-stock оказывает Пользователю услуги. Сервис включает в себя Сайт, а также технические решения prom-stock и его программно-аппаратные средства, которые используются prom-stock в целях оказания услуг. Также, Сервисы — отдельные технические решения prom-stock, позволяющие Пользователям получать конкретные услуги.',
                ),
              ]),
              createParagraph([
                createText('Услуга', 'bold'),
                createText(
                  ' — предоставление доступа к Сайту и Сервисам с целью получения, размещения, удаления, редактирования и использования Контента, получения товаров и услуг третьих лиц в порядке и на основаниях, предусмотренных Правилами.',
                ),
              ]),
              createParagraph(
                'Иные термины, используемые в Правилах и не определенные ими, трактуются и толкуются в соответствии с действующим законодательством РФ, а также обычаями делового оборота и сложившейся практикой оказания услуг с использованием электронных технических средств и сети Интернет.',
              ),

              createHeading('h2', '2. Общие положения.'),
              createParagraph(
                'Все термины и определения, используемые в Правилах, трактуются и применяются в соответствии с действующим законодательством РФ.',
              ),
              createParagraph(
                'Отношения Пользователей между собой или между Пользователями и иными третьими лицами по поводу использования ими Сайта и Сервиса регулируются действующим законодательством РФ.',
              ),
              createParagraph(
                'Правила определяют общие условия и порядок использования Сайта и Сервисов как зарегистрированными, так и незарегистрированными Пользователями.',
              ),
              createParagraph(
                'Правила размещаются на Сайте в открытом публичном доступе. Действительным является только тот текст Правил, который размещен на Сайте.',
              ),

              createHeading('h2', '3. Сайт, Сервисы и услуги prom-stock.'),
              createParagraph(
                'Сайт и Сервисы prom-stock предназначены для создания, размещения, систематизации в справочнокаталожном виде информации об электронных компонентах и электротехнике, приборах и устройствах электротехнического назначения, их параметрах и характеристиках, наличии или отсутствии в производстве и продаже, о производителях, покупателях и продавцах, для поиска такой информации, а также для обмена такой информацией между Пользователями.',
              ),
              createParagraph(
                'prom-stock предоставляет Пользователям техническую возможность с использованием Сайта и Сервисов размещать и публиковать свой Контент, в том числе с целью формирования справочно-информационного ресурса каталожного характера, содержащего информацию об электронных компонентах и электротехнике, приборах и устройствах электротехнического назначения, их параметрах и характеристиках, производителях, продавцах и покупателях. Размещение Контента на Сайте и с помощью Сервиса prom-stock не является распространением рекламы, поскольку преследует исключительно справочно-информационные цели и не осуществляется для продвижения конкретных товаров.',
              ),
              createParagraph(
                'prom-stock вправе предлагать Пользователям на Сайте другие услуги, включая формирование аналитических справок и отчетов, каталогов, подбор продукции по запросу, предоставление информации о поставщиках и продавцах, а также организовывать общение и коммуникации между Пользователями в рамках Сайта – на форумах и тематических площадках, предоставлять и размещать рекламу, и оказывать другие услуги.',
              ),
              createParagraph(
                'Услуги, оказываемые на Сайте, могут быть платными. Стоимость услуг устанавливается по единоличному усмотрению prom-stock.',
              ),

              createHeading('h2', '4. Регистрация на Сайте.'),
              createParagraph(
                'Использование Сайта, размещенного на нем Контента, получение услуг prom-stock (за исключением услуг, доступных только зарегистрированным Пользователям) доступно любому Пользователю при условии безусловного принятия и соблюдения им настоящих Правил.',
              ),
              createParagraph(
                'Регистрация на Сайте не является обязательной, но некоторые услуги и разделы Сайта доступны только для зарегистрированных Пользователей.',
              ),
              createParagraph(
                'Находясь на Сайте или приступая к его просмотру, использованию или получению через Сайт услуг prom-stock, Пользователь соглашается принять и соблюдать настоящие Правила.',
              ),
              createParagraph(
                'В случае, если незарегистрированный Пользователь соглашается получить платные услуги prom-stock, предлагаемые на Сайте, то считается заключившим с prom-stock разовый договор возмездного оказания услуг в порядке, предусмотренном статьями 435 и 438 ГК РФ, в момент, когда воспользовался любой из платных услуг prom-stock так, как указано на Сайте.',
              ),
              createParagraph(
                'Регистрируясь, Пользователь в порядке ст. 435 ГК РФ принимает оферту prom-stock и заключает с prom-stock рамочный договор возмездного оказания услуг. Заключение договора с prom-stock и принятие настоящих Правил происходит путем нажатия кнопки «Согласен», «Зарегистрироваться», «Принимаю» или аналогичных, которое завершает процедуру регистрации.',
              ),
              createParagraph(
                'Договор между prom-stock и Пользователем считается заключенным с даты регистрации, которая определяется автоматически программными средствами Сайта.',
              ),
              createParagraph(
                'Порядок оплаты услуг prom-stock указывается на Сайте при совершении Пользователем действий по получению платной услуги, либо в личном кабинете (аккаунте) Пользователя. Услуги prom-stock оплачиваются с использованием программных технических средств, интегрированных в Сайт и предоставленных банками или небанковскими кредитными или платежными организациями. При оплате услуг кредитными организациями или платежными системами может взиматься комиссия, о применимых комиссиях информация указывается в личном кабинете (аккаунте) Пользователя или на сайтах кредитных организаций или платежных систем.',
              ),
              createParagraph(
                'Регистрируясь на Сайте, Пользователь указывает о себе действительную, достоверную информацию, запрашиваемую в регистрационной форме. Информация, предоставление которой обязательно, помечена в регистрационной форме.',
              ),
              createParagraph(
                'После успешного завершения регистрации, Пользователь получает возможность использовать все возможности Сайта и получать все услуги prom-stock.',
              ),
              createParagraph(
                'prom-stock оставляет за собой право затребовать у Пользователя дополнительную информацию и документы, подтверждающие достоверность предоставленных им сведений. При возникновении сомнений в достоверности предоставленной информации prom-stock вправе приостановить доступ Пользователя для проведения процедуры идентификации. При выявлении недостоверной информации prom-stock вправе заблокировать доступ Пользователя до выяснения или до момента предоставления и подтверждения достоверной информации.',
              ),
              createParagraph(
                'Пользователь в любое время вправе прекратить использование Сайта, удалить свою учетную запись и данные о себе. Договор с prom-stock при этом расторгается. Уплаченные Пользователем в оплату услуг prom-stock денежные средства при расторжении договора возврату не подлежат.',
              ),

              createHeading(
                'h2',
                '5. Правила поведения на Сайте. Права и обязанности Пользователей.',
              ),
              createParagraph('Пользователь обязуется:'),
              createList([
                'не употреблять в публикациях и сообщениях ненормативную лексику (мат), а также не нарушать нормы этики и морали,',
                'не допускать хамства, оскорблений, унижения человеческого достоинства,',
                'не допускать дискриминации по расовому, национальному, половому, религиозному либо иным признакам, включая гражданство или подданство,',
                'не пропагандировать нарушение действующего законодательства в любой форме,',
                'не размещать прямую рекламу, в том числе в виде ссылок на рекламируемые интернет-ресурсы,',
                'не использовать Сервис с целью любой несанкционированной рассылки информации (спама),',
                'соблюдать требования действующего законодательства РФ о защите персональных данных в отношении других Пользователей,',
                'соблюдать требования действующего законодательства о персональных данных, об охране авторских прав и об информации (ГК РФ, Закон «О персональных данных», Закон «Об информации, информационных технологиях и защите информации» и другие применимые нормативные акты).',
              ]),
              createParagraph('Пользователю безусловно запрещено:'),
              createList([
                'размещать Контент, который является вредоносным, ущемляет права меньшинств, содержит оскорбления в адрес конкретных лиц или организаций, пропагандирует употребление наркотических и прочих средств, наносящих вред здоровью, а также содержит ненормативную и/или запрещенную лексику и мат, содержит материалы дискриминационного характера, разжигает какую-либо рознь, не ограничиваясь расовой, религиозной, национальной, половой рознью либо враждой, либо содержит материалы заведомо конфликтного и/или провокационного содержания,',
                'выполнять действия и размещать Контент, нарушающие российское и международное законодательство, а также размещать ссылки на ресурсы, характер и содержание которых нарушает действующее законодательство;',
                'использовать Сайт и Сервисы под чужим именем, вводить в заблуждение других Пользователей о своем статусе, положении, должности, месте работы, представляться другим лицом или выступать от имени третьего лица (в том числе, от имени организаций) не имея на то полномочий, в том числе – представляться работником Исполнителя;',
                'нарушать каким-либо образом нормальную работу Сайта;',
                'использовать Сайт и Сервисы для массовой публикации сообщений (в том числе комментариев) — спама, публикации рекламы, нарушения авторских прав, в том числе запроса/передачи/распространения программного обеспечения и авторских продуктов без согласия правообладателя;',
                'совершать действия, направленные на обход ограничений, установленных техническими средствами Сайта.',
              ]),

              createHeading('h2', '6. Размещение Контента.'),
              createParagraph('Пользователи гарантируют, что:'),
              createList([
                'они обладают всеми необходимыми правами на использование Контента - материалов, размещаемых ими на Сайте,',
                'они получили согласие правообладателей на размещение Контента на Сайте,',
                'размещение Контента на Сайте и его использование не нарушает какие-либо права любых третьих лиц.',
              ]),
              createParagraph(
                'Контент не должен нарушать действующее законодательство (в том числе, не должен наносить вред чести, достоинству и деловой репутации любых лиц, не должен способствовать разжиганию религиозной, расовой или межнациональной розни и так далее).',
              ),
              createParagraph(
                'Контент рекламного характера должен соответствовать требованиям законодательства о рекламе, включая требования о маркировке. Соблюдение требований законодательства о маркировке рекламы является исключительной ответственностью Пользователя, кроме случаев, когда prom-stock по отдельному соглашению с Пользователем оказывает Пользователю рекламные услуги и принимает на себя обязательства по размещению и распространению рекламы.',
              ),
              createParagraph(
                'В случае возникновения сомнений в наличии прав на материалы, а также в случае нарушения условия раздела 5 Правил, prom-stock оставляет за собой право удалить размещенные материалы, нарушающие соответствующие требования. В случае удаления двух или более материалов, размещенных одним и тем же Пользователем, такой Пользователь признается нарушившим условия Правил, его доступ к Сайту может быть прекращен.',
              ),
              createParagraph(
                'При размещении Контента на Сайте, любой Пользователь автоматически и безвозмездно предоставляет prom-stock неисключительные права на использование, воспроизведение, распространение, переработку, создание производных произведений, а также на доведение их до всеобщего сведения через Сайт. prom-stock пользуется такими правами по своему усмотрению и только в случаях, когда такое использование не нарушает прав Правообладателей. Такое предоставление и использование прав не означает передачу Контента в рекламных целях, не является распространением рекламы и служит исключительно для формирования справочно-информационного ресурса prom-stock.',
              ),
              createParagraph(
                'Поскольку материалы, размещенные на Сайте, могут становиться общедоступными с момента их опубликования на Сайте, prom-stock не несет ответственность за несанкционированное копирование и использование размещенных на Сайте материалов.',
              ),
              createParagraph(
                'Любое заимствование/копирование материалов, размещенных на Сайте, запрещено, если на такое заимствование/копирование не получено предварительное согласие Правообладателей и prom-stock.',
              ),
              createParagraph(
                'prom-stock оставляет за собой право производить выборочно предварительную модерацию размещаемых на Сайте материалов, и в случае выявления нарушений законодательства РФ или Правил безвозвратно удалять такие материалы.',
              ),
              createParagraph(
                'Поскольку полная и своевременная предварительная модерация абсолютно всех публикуемых материалов не может осуществляться по объективным причинам, prom-stock не несет ответственности за размещаемый на Сайте Контент, однако прикладывает все возможные усилия для предотвращения и пресечения нарушений авторских прав и действующего законодательства на Сайте.',
              ),
              createParagraph(
                'prom-stock оставляет за собой право указывать на Пользователя как на лицо, загрузившее Контент, путем размещения данных Пользователя, идентифицирующих его на Сайте (наименование аккаунта Пользователя или иное индивидуальное обозначение, не содержащее персональных данных).',
              ),
              createParagraph(
                'prom-stock также оставляет за собой право раскрывать по запросу уполномоченных органов государственной власти и организаций информацию о Пользователе, разместившем Контент (наименование аккаунта Пользователя или иное индивидуальное обозначение, не содержащее персональных данных), при этом персональные данные не могут быть предоставлены без соответствующего судебного акта либо акта уполномоченного органа государственной власти.',
              ),

              createHeading('h2', '7. Охрана авторских прав.'),
              createParagraph(
                'В соответствии с требованиями ГК РФ, статей 10 и 15.7 Закона «Об информации, информационных технологиях и защите информации», prom-stock принимает на себя обязательства посильной охраны авторских и смежных прав.',
              ),
              createParagraph([
                createText(
                  'Если какое-либо лицо является обладателем авторских или иных прав на какие-либо размещенные в Сервисе или на Сайте материалы (включая исключительные права на воспроизведение, распространение, публичный показ, на доведение до всеобщего сведения), и обнаружило, что эти права нарушаются при размещении материалов в Сервисе и на Сайте, такое лицо должно незамедлительно связаться с prom-stock. Для этого необходимо прислать на электронную почту ',
                ),
                createLink('mailto:client@prom-stock.ru', [createText('client@prom-stock.ru')]),
                createText(
                  ' скан письма за подписью правообладателя или его уполномоченного представителя, которое должно содержать:',
                ),
              ]),
              createList([
                'информацию об объекте авторского права (наименование, регистрация в Роспатенте, если это применимо, и аналогичные сведения, подтверждающие наличие прав),',
                'информацию о правообладателе, для юридического лица — наименование, адрес, сканированное изображение документа о государственной регистрации,',
                'информацию о представителе правообладателя, подписавшего письмо (ФИО, должность, сканированное изображение доверенности либо приказа/протокола о назначении — для лица, имеющего право действовать без доверенности),',
                'точное указание на место размещения материалов, права на которые принадлежат Правообладателю,',
                'описание сути нарушения прав (почему распространение данной информации запрещено Правообладателем).',
                'дату и подпись.',
              ]),
              createParagraph(
                'В течение 10 (десяти) рабочих дней после получения указанной информации и документов prom-stock рассмотрит сообщение, и, если указанные сведения подтвердятся, prom-stock удалит соответствующие материалы, либо по требованию разместит ссылку на правообладателя или урегулирует вопрос иным образом, согласно законодательству.',
              ),

              createHeading(
                'h2',
                '8. Деятельность, противоположная нормам морали, нравственности и другим общепринятым правилам поведения.',
              ),
              createParagraph(
                'prom-stock обязуется не принимать участия в и не иметь отношения к любой деятельности, и не принимать какого-либо участия в ней, если эта деятельность, товары, работы, услуги противоположны нормам морали, нравственности и общепринятым правилам поведения, в том числе:',
              ),
              createList([
                'товары и/или услуги порнографического характера;',
                'проституция,',
                'работорговля,',
                'торговля человеческими органами и тканями,',
                'несанкционированные опыты объектами животного и растительного происхождения,',
                'любые опыты над человеком,',
                'деятельность, достоверно наносящая непоправимый ущерб окружающей среде,',
                'торговля оружием без необходимых лицензий и разрешений и с нарушениями закона,',
                'лицензируемые виды деятельности без наличия действующих лицензий и/или разрешений,',
                'лекарственные средства и медицинские препараты, биологически активные добавки, относительно которых нет достоверных сведений об их безопасности;',
                'исторические, культурные ценности, музейные экспонаты, оборот которых запрещен законом;',
                'запрещенные законом наркотические и психотропные вещества, виды психологически вредного воздействия на человека и животных;',
                'торговля контрафактным товаром, с полными или частичными копиями зарегистрированных товарных марок, с иными нарушениями авторских, патентных или иных смежных прав;',
                'благотворительность, взносы, пожертвования без лицензий (регистрации), и с нарушением закона;',
                'продажа программного обеспечения (ПО) без договора с поставщиками (дистрибьюторами) и/или и правообладателями;',
                'продажа аудио, видео, фото, книг, картин, а также других материалов, являющихся объектами авторского права, без договоров с правообладателями;',
                'все виды азартных игр, запрещенных действующим законодательством РФ, букмекерские конторы, тотализаторы, лотереи, за исключением лиц, осуществляющих такую деятельность в соответствии с законодательством РФ;',
                'продажа и распространение продукции и материалов, пропагандирующих насилие, межнациональную рознь, терроризм и экстремистскую деятельность;',
                'товары и/или услуги, запрещенные или ограниченные в обороте законом;',
                'все и любые виды деятельности, направленные на легализацию денежных средств, полученных преступным путем, и финансирование терроризма, включая уклонение от уплаты налогов, мошенническую деятельность, запрещенные виды операций с наличными и безналичными денежными средствами, ценными бумагами и иными финансовыми инструментами,',
                'любая религиозная деятельность или деятельность, связанная с оборотом предметов религии и культа, вне зависимости от того, признана ли она законной или незаконной, в том числе – деятельность религиозных организаций.',
              ]),
              createParagraph(
                'Указанный перечень не является исчерпывающим, и prom-stock вправе дополнять его по собственному усмотрению.',
              ),
              createParagraph(
                'В случае, если prom-stock выявлен и зафиксирован факт причастности любого Пользователя к указанным видам деятельности, prom-stock имеет право немедленно прекратить с ним все возможные отношения, в том числе, независимо от того, использовался ли Сайт или Сервисы prom-stock в указанных целях, или нет.',
              ),
              createParagraph(
                'Никто не имеет права использовать Сайт и Сервисы prom-stock в целях, указанных выше. В случае выявления таких фактов, нарушители обязаны немедленно прекратить такую деятельность и безусловно возместить prom-stock и третьим лицам, права которых нарушены, причиненные убытки, в том числе – упущенную прибыль и компенсацию вреда чести, достоинству или деловой репутации.',
              ),

              createHeading('h2', '9. Конфиденциальность. Безопасность.'),
              createParagraph([
                createText(
                  'Все вопросы, связанные с обработкой персональных данных, получением и обработкой Пользовательской информации, регламентируются Политикой конфиденциальности prom-stock, которая является необъемлемой частью настоящих Правил и размещена по адресу ',
                ),
                createLink('http://prom-stock.ru/PrivacyPolicy.pdf', [
                  createText('http://prom-stock.ru/PrivacyPolicy.pdf'),
                ]),
                createText('.'),
              ]),
              createParagraph(
                'Принимая настоящие Правила и соглашаясь с ними, Пользователь безусловно принимает Политику конфиденциальности prom-stock и соглашается с ней. Несмотря на это, Пользователь должен явно и недвусмысленно выразить свое согласие на обработку персональных данных. При отказе от обработки персональных данных Пользователь утрачивает возможность зарегистрироваться на Сайте, и ему может быть отказано в доступе к Сайту или услугам prom-stock.',
              ),

              createHeading('h2', '10. Безопасность. Ответственность.'),
              createParagraph(
                'prom-stock предпринимает все необходимые технические и организационные меры по обеспечению информационной безопасности и нормальной работоспособности Сайта и Сервисов, однако ни при каких обстоятельствах не несет ответственности за неисполнение или ненадлежащее исполнение обязательств и возможный ущерб, если они возникли по причине:',
              ),
              createList([
                'неправомерных действий третьих лиц, направленных на нарушения информационной безопасности или нормального функционирования Сайта,',
                'сбоев в работе Сайта, вызванных ошибками в коде, компьютерными вирусами и иными посторонними фрагментами кода в программном обеспечении Сайта, кроме случаев, допущенных по вине prom-stock,',
                'отсутствия (невозможности установления, прекращения и пр.) Интернет-соединений между серверами Пользователя и сервером Сайта,',
                'проведения уполномоченными органами оперативно-розыскных мероприятий,',
                'установления государственного регулирования (или регулирования иными организациями) хозяйственной деятельности коммерческих организаций в сети интернет и/или установления указанными субъектами разовых ограничений, затрудняющих или делающих невозможным исполнение обязательств prom-stock,',
                'других случаев, связанных с действиями (бездействием) пользователей сети Интернет и/или других субъектов, направленными на ухудшение работы Сайта и Сервисов с использованием сети интернет и/или компьютерного оборудования.',
              ]),
              createParagraph(
                'prom-stock не несет ответственности за убытки, причиненные Пользователю:',
              ),
              createList([
                'в результате сообщения им недостоверной информации,',
                'причиненные ему или любым третьим лицам его собственными действиями (бездействием),',
                'в результате разглашения третьим лицам информации, предоставленной Пользователем, произошедшего не по вине prom-stock.',
              ]),
              createParagraph(
                'prom-stock не несет ответственности по спорам и разногласиям, возникающим между Пользователями.',
              ),

              createHeading('h2', '11. Заключительные положения.'),
              createParagraph(
                'prom-stock имеет право в одностороннем порядке изменять Правила путем опубликования новой редакции Правил на Сайте. Измененные Правила вступают в силу по истечении 15 (пятнадцати) календарных дней с даты опубликования. В случае, если Пользователь по истечении 15-дневного срока не прекратил использование Сайта, не удалил свои регистрационные данные, то считается принявшим новую редакцию Правил и полностью согласившимся с ней.',
              ),
              createParagraph(
                'Во всем остальном, не предусмотренном Правилами, prom-stock и Пользователи руководствуются положениями действующего законодательства Российской Федерации.',
              ),
            ]),
          },
        ],
      },
    ],

    // --- SEO ---
    meta: {
      title: 'Правила использования Сайта | Prom-Stock',
      description:
        'Официальные правила использования сайта и сервисов Prom-Stock. Условия размещения контента и взаимодействия пользователей.',
    },
  }
}
